#include <stdio.h>
void help(void)
{
	printf("~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n");
	printf("简单的端口扫描程序,使用全链接扫描\n");
	printf("作者邮箱yxwzyyk@gmail.com\n");
	printf("参数-i设定要扫描的目标ip,默认扫描127.0.0.1也就是你自己的ip\n");
	printf("例如:-i 192.168.0\n\n");
	printf("参数-p设定要扫描的端口范围,用'-'分开,默认扫描全部端口\n");
	printf("例如:-p 1-200\n");
	printf("如果没有'-'则扫描从1到你输入的值\n");
	printf("例如:-p 500 则扫描从1-500\n\n");
	printf("参数-c设定用多少线程,默认10线程\n");
	printf("例如:-c 20\n");
	printf("~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n");
}
